import { Link } from "react-router-dom";

function Para() {

    const paras = [
        "الم",
        "سَيَقُولُ",
        "تِلْكَ الرُّسُلُ",
        "لَنْ تَنَالُوا",
        "وَالْمُحْصَنَاتُ",
        "لَا يُحِبُّ اللَّهُ",
        "وَإِذَا سَمِعُوا",
        "وَلَوْ أَنَّنَا",
        "قَالَ الْمَلَأُ",
        "وَاعْلَمُوا",
        "يَعْتَذِرُونَ",
        "وَمَا مِنْ دَابَّةٍ",
        "وَمَا أُبَرِّئُ",
        "رُبَمَا",
        "سُبْحَانَ الَّذِي",
        "قَالَ أَلَمْ",
        "اقْتَرَبَ",
        "قَدْ أَفْلَحَ",
        "وَقَالَ الَّذِينَ",
        "أَمَّنْ خَلَقَ",
        "اتْلُ مَا أُوحِيَ",
        "وَمَنْ يَقْنُتْ",
        "وَمَا لِيَ",
        "فَمَنْ أَظْلَمُ",
        "إِلَيْهِ يُرَدُّ",
        "حم",
        "قَالَ فَمَا خَطْبُكُمْ",
        "قَدْ سَمِعَ اللَّهُ",
        "تَبَارَكَ الَّذِي",
        "عَمَّ"
    ];

    return (
        <section className="para-section">

            <div className="para-container">

                {paras.map((para, index) => (

                    <Link
                        to={`/para/${index + 1}`}
                        className="para-card"
                        key={index}
                    >

                        <span>پارہ {index + 1}</span>

                        <h3>{para}</h3>

                    </Link>

                ))}

            </div>

        </section>
    );
}

export default Para;